title: Essential CVS : l'essentiel et plus!
date: 2007-05-20 18:45:47

<h3>Pour qui ?</h3>

<p>&Agrave; tout le monde &agrave; priori! Chacun pourra retirer
quelque chose de ce livre :</p>

<ul>
  <li>L'utilisateur d&eacute;butant gr&acirc;ce au <q>Quickstart
  guide</q>.</li>

  <li>L'utilisateur confirm&eacute; qui a appris &agrave; se
  servir de CVS par la pratique.</li>

  <li>L'administrateur CVS et le gestionnaire d'un projet.</li>
</ul>

<h3>du bon contenu</h3>

<p>M&ecirc;me si dans l'esprit de beaucoup de gens CVS est
aujourd'hui d&eacute;pass&eacute;, il reste un excellent logiciel
qui reste encore d'actualit&eacute;. Et encore beaucoup de
projets de taille importante l'utilisent, c'est notamment le cas
des <em>BSD</em>.<br>
Ce livre est une introduction tr&egrave;s compl&egrave;te. Il va
de l'utilisation la plus simple &agrave; la plus
compliqu&eacute;e. Toute la partie utilisateur est
expliqu&eacute;e en d&eacute;tail, ce qui permettra aux
d&eacute;butants de suivre facilement le rythme du livre.<br></p>

<p>Une chose tr&egrave;s appr&eacute;ciable, c'est que l'auteur
d&eacute;crit de mani&egrave;re pr&eacute;cise les
m&eacute;canismes internes de CVS. Notamment le fonctionnement de
RCS, un programme qui permet de g&eacute;rer plusieurs versions
d'un m&ecirc;me fichier.</p>

<p>L'administration d'un serveur CVS est aussi largement
couverte. Avec les diff&eacute;rentes fa&ccedil;ons de
g&eacute;rer un projet. Ce livre aborde notamment
l'ex&eacute;cution automatique de scripts, qui est
malheureusement tr&egrave;s peu utilis&eacute;e. Si vous
&ecirc;tes int&eacute;ress&eacute;s par l'utilisation de CVS pour
vos projets je vous conseille tout particuli&egrave;rement cette
partie du livre.</p>

<h3>et parfois ... du moins bon</h3>

<p>Mais ce livre n'est pas parfait. En effet je pense que
l'auteur devrait parler un peu plus longuement des erreurs que
l'on peut commettre avec CVS. Notamment sur les projets de taille
importante.<br>
De plus le livre se perd parfois un peu trop dans des longueurs.
Un style plus efficace aurait &eacute;t&eacute; bienvenu dans
certaines parties.</p>

<p>La FAQ pr&eacute;sente &agrave; la fin du livre semble un peu
inutile, car les FAQ pr&eacute;sentent sur Internet
r&eacute;pondent aux m&ecirc;mes questions.<br>
Dans le m&ecirc;me esprit il y a une r&eacute;f&eacute;rence des
commandes &agrave; la fin du livre, qui ne semble pas
indispensable.</p>

<h3>dans l'ensemble un tr&egrave;s bon livre</h3>

<p>Au final ce livre remplit bien son r&ocirc;le. Il est
tr&egrave;s complet, et si un sujet n'est pas trait&eacute;, il
donne d'excellents pointeurs.<br>
&Agrave; lire et &agrave; recommander!</p>
